<template>
  <v-data-table :items="items"></v-data-table>
</template>

<script setup>
const items = [
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'TN',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'TN',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'TN',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
    {
      คลังสินค้า: 'SV',
      สินค้า: 'ล้อแม็ก',
      ชนิดสินค้า: 'ล้อ',
      จำนวน: '100',
      ราคาขาย: '2000',
    },
  ]
</script>

<style>


</style>